SOAP_Templates/AppendChunk.txt

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <AppendChunk xmlns="http://api.filesanywhere.com/">
      <Token>{REPLACE_ME_1}</Token>
      <Path>{REPLACE_ME_2}</Path>
      <ChunkData>{REPLACE_ME_3}</ChunkData>
      <Offset>{REPLACE_ME_4}</Offset>
      <BytesRead>{REPLACE_ME_5}</BytesRead>
      <isLastChunk>{REPLACE_ME_6}</isLastChunk>
    </AppendChunk>
  </soap12:Body>
</soap12:Envelope>
